Catalogs/ДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДополнительныеРеквизиты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПосещений</v8:Type>
						<v8:Type>cfg:EnumRef.МетодыОплаты</v8:Type>
						<v8:Type>cfg:EnumRef.НаправлениеОбмена</v8:Type>
						<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатусыПодписанияДоговоров</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКомментариев</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЗаказа</v8:Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
						<v8:Type>cfg:EnumRef.КатегорииКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.КаналыРынка</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтрагентов</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПоказателей</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ДополнительныеРеквизитыСервер/Ext/Module.bsl
// РАБОТА С ДОПОЛНИТЕЛЬНЫМИ РЕКВИЗИТАМИ //

Процедура ДобавитьДополнительныеРеквизиты (Форма,ТипОбъекта,ГруппаФормы, ТаблицаДопРеквизитов = "") Экспорт
	СписокДопРеквизитов = СписокДополнительныхРеквизитов(ТипОбъекта);
	
	Если СписокДопРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтоАдресВременногоХранилища(ТаблицаДопРеквизитов) Тогда
		Таблица = ПолучитьИзВременногоХранилища(ТаблицаДопРеквизитов);
	Иначе
		Таблица = Новый ТаблицаЗначений;
		Таблица.Колонки.Добавить("Свойство");
		Таблица.Колонки.Добавить("Значение");
	КонецЕсли;	
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого ДопРеквизит Из СписокДопРеквизитов Цикл
		ИмяДР = СформироватьИмяДопРеквизита(ДопРеквизит); 
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ДопРеквизит.Типзначения));
		Реквизит    = Новый РеквизитФормы(ИмяДР,Новый ОписаниеТипов(МассивТипов),,ДопРеквизит.Наименование);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
	КонецЦикла;	
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого ДопРеквизит Из СписокДопРеквизитов Цикл
		ИмяДР    = СформироватьИмяДопРеквизита(ДопРеквизит);
		Поле     = Форма.Элементы.Добавить(ИмяДР,Тип("ПолеФормы"),ГруппаФормы);
		Если ТипЗнч(ДопРеквизит.Типзначения) = Тип ("Булево") Тогда
			Поле.Вид = ВидПоляФормы.ПолеВвода;
		Иначе 
			Поле.Вид = ВидПоляФормы.ПолеФлажка;
		КонецЕсли;
		Поле.ПутьКДанным = СформироватьИмяДопРеквизита(ДопРеквизит);
		ИскомаяСтрока = Таблица.Найти(ДопРеквизит,"Свойство");
		Если ИскомаяСтрока <> Неопределено Тогда 
			Форма[ИмяДР] = ИскомаяСтрока.Значение;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

Функция ПолучитьТаблицуДополнительныхРеквизитов (Форма,ТипОбъекта,ГруппаФормы) Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Свойство");
	Таблица.Колонки.Добавить("Значение");
	СписокДопРеквизитов = СписокДополнительныхРеквизитов(ТипОбъекта);
	Для Каждого ДопРеквизит Из СписокДопРеквизитов Цикл
		ИмяДР = СформироватьИмяДопРеквизита(ДопРеквизит);
		Если Форма.Элементы.Найти(ИмяДР) <> Неопределено Тогда
			Значение = Форма[ИмяДР];
			Если ЗначениеЗаполнено(Значение) Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Свойство = ДопРеквизит;
				НоваяСтрока.Значение = Значение;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	Возврат ПоместитьВоВременноеХранилище(Таблица,Новый УникальныйИдентификатор);
КонецФункции	

Функция СписокДополнительныхРеквизитов (ТипОбъекта)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДополнительныеРеквизиты.Назначение) = &Назначение";
	Запрос.УстановитьПараметр("Назначение",ТипОбъекта);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции	

Функция СформироватьИмяДопРеквизита (ДопРеквизит)
	Возврат "ДопРеквизит_" + СтрЗаменить(Строка(ДопРеквизит.УникальныйИдентификатор()),"-","_");
КонецФункции	

// РАБОТА С АНКЕТАМИ //
